# Modern Shell Tools
brew "starship"                  # Fast, customizable prompt
brew "zsh-syntax-highlighting"   # Fish-like syntax highlighting
brew "zsh-autosuggestions"       # Fish-like autosuggestions
brew "fzf"                       # Fuzzy finder
brew "zoxide"                    # Smarter cd command
brew "eza"                       # Modern ls replacement
brew "bat"                       # Better cat with syntax highlighting
brew "ripgrep"                   # Ultra-fast grep alternative
brew "fd"                        # Simple, fast find alternative

# Core Development Tools
brew "gh"                        # GitHub CLI
brew "git"
brew "git-lfs"
brew "coreutils"
brew "wget"
brew "tlrc"                      # Simplified man pages (tldr client in Rust)

# Languages & Version Management
brew "pyenv"
brew "pyenv-virtualenv"
brew "asdf"
brew "bun"
brew "yarn"  # Install globally via Homebrew (faster than asdf)

# Databases & Services
brew "postgresql@17"
brew "redis"

# Utilities
brew "jq"                        # JSON processor
brew "httpie"                    # Modern curl alternative
brew "gnupg"
brew "imagemagick"

# Fast Python tools
brew "uv"                        # Fast Python package manager

# Casks
cask "wezterm"                   # GPU-accelerated terminal emulator
cask "deskpad"