# Modern Shell Tools
brew "starship"                  # Fast, customizable prompt
brew "zsh-syntax-highlighting"   # Fish-like syntax highlighting
brew "zsh-autosuggestions"       # Fish-like autosuggestions
brew "fzf"                       # Fuzzy finder
brew "zoxide"                    # Smarter cd command
brew "eza"                       # Modern ls replacement
brew "bat"                       # Better cat with syntax highlighting
brew "ripgrep"                   # Ultra-fast grep alternative
brew "fd"                        # Simple, fast find alternative

# Core Development Tools
brew "gh"                        # GitHub CLI
brew "vercel-cli"                # Vercel CLI for deployment and development
brew "git"
brew "git-lfs"
brew "coreutils"
brew "wget"
brew "tlrc"                      # Simplified man pages (tldr client in Rust)
brew "codex"                     # OpenAI's coding agent
brew "opencode"                  # AI coding agent for terminal
brew "gemini-cli"                # Google Gemini AI CLI
cask "ollama-app"                # Local LLM runner for QMD embeddings

# Languages & Version Management
brew "pyenv"
brew "pyenv-virtualenv"
brew "asdf"
brew "node"
brew "bun"
brew "yarn"  # Install globally via Homebrew (faster than asdf)
brew "pnpm"  # Fast Node.js package manager

# Databases & Services
brew "postgresql@17"
brew "redis"

# Utilities
brew "tree"                      # Display directory tree structure
brew "jq"                        # JSON processor
brew "httpie"                    # Modern curl alternative
brew "gnupg"
brew "imagemagick"
brew "promptfoo"                 # LLM prompt testing and evaluation
brew "tw93/tap/mole"             # Mac cleanup and optimization tool (mo)

# Image Optimization
brew "oxipng"                    # Fast PNG optimizer in Rust
brew "pngquant"                  # PNG lossy compression
brew "svgo"                      # SVG optimizer

# Fast Python tools
brew "uv"                        # Fast Python package manager

# Cloud Storage Tools
brew "b2-tools"                  # Backblaze B2 command-line tool

# Casks
cask "wezterm"                   # GPU-accelerated terminal emulator
cask "1password-cli"             # 1Password CLI for secrets management
cask "deskpad"
cask "docker-desktop"            # Docker Desktop with CLI tools
cask "gcloud-cli"                # Google Cloud CLI
cask "jordanbaird-ice"           # Menu bar manager for macOS
cask "nikitabobko/tap/aerospace" # i3-like tiling window manager for macOS
cask "claude-code"               # Claude AI coding assistant CLI
