tap "aprilnea/tap"                 # OpenLogi cask
tap "modem-dev/tap"               # Hunk diff review CLI

# Shell
brew "fish"                      # Modern shell with built-in features
brew "herdr"                     # Terminal-native agent multiplexer and persistent panes
brew "starship"                  # Cross-shell prompt with git, language detection

# Core Development Tools
brew "gh"                        # GitHub CLI
brew "vercel-cli"                # Vercel CLI for deployment and development
brew "git"
brew "git-lfs"
brew "coreutils"
brew "wget"
brew "tlrc"                      # Simplified man pages (tldr client in Rust)
brew "opencode"                  # AI coding agent for terminal
brew "gemini-cli"                # Google Gemini AI CLI

# Languages & Version Management
brew "mise"
brew "node"
brew "bun"
brew "yarn"  # Install globally via Homebrew
brew "pnpm"  # Fast Node.js package manager

# Databases & Services
brew "postgresql@17"
brew "redis"
brew "neonctl"                   # Neon serverless Postgres CLI

# Utilities
brew "tree"                      # Display directory tree structure
brew "fzf"                       # Fuzzy finder for shell
brew "jq"                        # JSON processor
brew "httpie"                    # Modern curl alternative
brew "gnupg"
brew "imagemagick"
brew "pandoc"                    # Universal document converter (markdown -> plain text)
brew "typst"                     # Document compiler for rendering generated .typ files
brew "ffmpeg"                    # Audio/video processing (required by lue-reader TTS)
brew "yt-dlp"                    # YouTube video/audio downloader
brew "promptfoo"                 # LLM prompt testing and evaluation
brew "tw93/tap/mole"             # Mac cleanup and optimization tool (mo)

# Modern CLI Tools
brew "ast-grep"                  # Structural code search/rewrite (sg command)
brew "zoxide"                    # Smart cd with frecency ranking (z command)
brew "fd"                        # Modern find replacement
brew "shellcheck"                # Shell script linter
brew "just"                      # Simple command runner
brew "modem-dev/tap/hunk"        # Review-first terminal diff viewer

# Image Optimization
brew "oxipng"                    # Fast PNG optimizer in Rust
brew "pngquant"                  # PNG lossy compression
brew "svgo"                      # SVG optimizer

# Fast Python tools
brew "uv"                        # Fast Python package manager
brew "libyaml"                   # YAML parsing library (fast PyYAML backend)

# Cloud Storage Tools
brew "b2-tools"                  # Backblaze B2 command-line tool

# Casks
cask "codex"                     # OpenAI's coding agent
cask "claude-code"               # Claude AI coding assistant CLI
cask "zed"                       # Primary code editor
cask "ollama-app"                # Local LLM runner for QMD embeddings
cask "wezterm"                   # GPU-accelerated terminal emulator
cask "openlogi"                  # Local-first Logitech mouse configuration (Options+ replacement)
cask "1password-cli"             # 1Password CLI for secrets management
cask "orbstack"                  # Lightweight Docker Desktop alternative for containers/VMs
cask "gcloud-cli"                # Google Cloud CLI
cask "jordanbaird-ice"           # Menu bar manager for macOS
cask "nikitabobko/tap/aerospace" # i3-like tiling window manager for macOS
